# 1预定义字符集
# 2字符组

# 1量词
# 2贪婪和非贪婪
# 3边界符
# 4 ^ $

# 1分组
# 2|
# 3 search
# group
# groups


# 1预定义字符集
# . 表示任意字符,除了\n换行
# \d  表示数字   d-digit
# \D  匹配非数字
# \s  匹配空白字符 \t \r \n 空格  s-space
# \S  匹配非空白字符
# \w  匹配字母 数字 下划线 中文
# \W  匹配非字母 数字 下划线 中文
# \t  匹配制表符
# \n  匹配换行

# ^ 在字符组开头的位置出现代表 除了...的意思
# 注意点:为了防止转义,在正则表达式中或者要匹配的字符串中,无脑加r实现匹配

# 2字符组
# [abc] #匹配一个字符 或
import re

strvar = r'abfdjfjacjdf'
res = re.findall(r'a[abc]',strvar)
print(res)  #['ab', 'ac']

# 1量词
# ?  0或1个
# +  1个或多个
# *  0个或多个
# {2,4} 重复2-4次
# {2}  重复2次
# {2,}  至少重复1次

# 2贪婪和非贪婪
# 贪婪   .+量词    尽量多个匹配
# 非贪婪 .+量词+?  尽量少的匹配.匹配到一个满足条件的就返回,接着匹配第二个,直到没有符合条件的为止       

# 3边界符  /b   
# 左边界  /bw   w开头
# 右边界  d/b   d结尾  空格是边界

# \b 本身是转义字符 退格,退到光标上一位
# \b 在正则中还有边界符的意思

# 4 ^ $
# ^ 整个字符串的开头
# $ 整个字符串的结尾
# 当使用了^ $ 代表要把该字符串看成一个整体

# 1分组
# ()整体  默认显示分组
# ?: 不止显示分组

# 2|  或
# ab|cd

# 3 search  
# 返回第一个匹配到的,就返回.不匹配第二个了,返回的是对象
# findall返回的是列表

# group   获取匹配到的内容  多
# groups  获取匹分组里的内容 少

# findall : 从左到右,匹配出所有的内容,返回到列表
		  # 问题是,匹配到的字符串和分组的内容不能同时显示;

# search  : 从左到右,匹配到一组内容就直接返回,返回的是对象
		  # 优点是,可以让匹配到的内容和分组里的内容同时显示;
		  # 匹配不到内容时,返回的是None
		  
# obj.group() : 获取匹配到的内容
# obj.groups(): 获取分组里面的内容



















































