''''''
'''

# part1
# 1.集合的值和字典的键有什么数据类型上的要求
# 2.对于python3.6来说,变量的缓存机制
# 3.bool类型为假的十种情况
# 4.Number类型的自动转换原则
# 5.容器类型强转特征
# 6.什么样的类型可以强转成字典   nok
# 7.什么情况下会出现短路
# 8.is和==有什么区别
# 9.逻辑运算符优先级排序
# 10.<< >> 运算规律

# part2
# 1.打印一行十个小星星
# 2.通过打印变量,直接输出一行十个小星星
# 3.打印一行十个小星星,奇数个打印★,偶数个打印☆
# 4.一个循环打印十行十列小星星
# 5.一个循环打印十行十列隔列变色小星星
# 6.一个循环打印十行十列隔行变色小星星
# 7.两个循环十行十列小星星
# 8.两个循环十行十列隔列/隔行换色小星星
# 9.99乘法表
# 10.吉利数字100~999,找123 321 111
# 11.公鸡1块钱1只,母鸡3块钱一只,小鸡5毛钱一只,问: 用100块钱买100只鸡,有多少种买法?
# 12.国际象棋
# 13.打印1~100不含有3的数字.   nok

# part3
# 1.break 和 continue有什么区别
# 2.[1,2,3,(4,5,6,{'a','b'})] 如何遍历
# 3.([1,2],{3,4})如何遍历
# 4密码111,输错三次循环终止,每次打印剩余输入机会.
# 5求结果
	# 87 % 7
	# -87 % 7
	# 87 % 7
	# 81 // 7
	# 81.0 // 7
	# ~18
	# ~-18
	# 40 >> 2 ** 2
	# 1 > 2 and 3<=4 or not 0

# part4
# 字符串函数
# 把字符串的旧字符换成新字符
# 判断字符串是否由空白符组成  nok
# 将所有字母变成小写 
# 字符串首字母大写 
# 按某字符将列表拼接成字符串(容器类型都可)
# 默认去掉首尾两边的空白符
# 判断是否以某个字符或字符串结尾 
# 统计字符串中某个元素的数量 
# 计算字符串的长度 
# 判断是否以某个字符或字符串为开头 
# 查找某个字符串第一次出现的索引位置 
# 检测字符串是否以数字组成  必须是纯数字
# 填充字符串,原字符居中 (默认填充空格)
# 将所有字母变成大写
# 大小写互换 
# 按某字符将字符串分割成列表(默认字符是空格)
# 每个单词的首字母大写 

# part5
# 列表函数
# 列表添加方法,说明用法
# 列表删除方法,说明用法
# 如何获取一个值的索引
# 如何排序,如何倒序
# 统计元素在列表中的个数
# 翻转列表
# 什么是深浅拷贝
'''

# # 1.集合的值和字典的键有什么数据类型上的要求
# # 必须是不可变数据类型：numbers(int float bool complex) tuple str
# # 可变数据类型：list dict set
#
# # 集合的本质是没有值的字典
#
# # 2.对于python3.6来说,变量的缓存机制
# 	py3.6
#     numbers
# 		int    -5~正无穷  值相同，id相同
# 		float  非负浮点数 值相同，id相同
# 		bool	值相同，id相同
# 		complex	值相同，id不同（正虚数除外  5j）
# 	容器数据
# 		str     值相同，id相同
# 		tuple	值相同，id不同（空元组除外）
# 		list	值相同，id不同
# 		dict	值相同，id不同
# 		set		值相同，id不同
#
# 	py3.7  上述6个标准数据类型，值相同，id相同（经过测试，list除外）
#
#
# # 3.bool类型为假的十种情况
#     numbers
# 		int    0
# 		float	0.0
# 		bool	False
# 		complex	0j
# 	容器数据
# 		str     ''
# 		tuple	()
# 		list	[]
# 		dict	{}
# 		set		set()
# 	None
#
# # 4.Number类型的自动转换原则
# 	从低精度到高精度转换
# 	bool-->int-->float-->complex
#
# # 5.容器类型强转特征
# 	str
# 		可以强制任何类型的数据，在数据的两边加上引号
# 	tuple
# 		str 把字符串的每个字符单独拿出来，作为tuple的元素
# 		dict
# 			把字典的键，作为元组的元素
# 		list/set
# 			把数据的两边换成()
#
# 	list
# 		str 把字符串的每个字符单独拿出来，作为list的元素
# 		dict
# 			把字典的键，作为list的元素
# 		tuple/set
# 			把数据的两边换成[]
# 	set
# 		str 把字符串的每个字符单独拿出来，作为set的元素
# 		dict
# 			把字典的键，作为set的元素
# 		tuple/set
# 			把数据的两边换成{}


# # 6.什么样的类型可以强转成字典   nok
# 	等长的二级容器
# 	二级容器的长度是2
#
# # 7.什么情况下会出现短路
# 	False and
# 	True or
#
# # 8.is和==有什么区别
# 	is 比较的是id
# 	== 比较的是数值
#
# # 9.逻辑运算符优先级排序
#    () > not > and >or
#
# # 10.<< >> 运算规律
# 	<< 左移  *2的n次幂   n是左移的位数
# 	>> 左移  /2的n次幂   n是右移的位数
	








































