# (5)format的填充符号的使用( ^ > < )

strvar = '{who:*^10}去长春医药公司,{do:>>10},感觉{feel:!<10}'.format(who='李亚锋',do='扎疫苗',feel='被掏空')
print(strvar)
#***李亚锋****去长春医药公司,>>>>>>>扎疫苗,感觉被掏空!!!!!!!

# (6)进制转换等特殊符号的使用( :d :f :s :, )

# 一 整型  :d
# 01   :d 整型占位符 (强制要求类型是整型)
strvar = '{:d}个花露水'.format(9)
print(strvar)  #9个花露水

# 02   :3d 占3位,不够三位拿空格来补位(原字符串居右)
strvar = '{:3d}个花露水'.format(9)
# strvar = '{:>3d}个花露水'.format(9)  和上面行等效
print(strvar)  #  9个花露水

strvar = '{:<3d}个花露水'.format(9)  #(原字符串居左)
print(strvar)  #9  个花露水

strvar = '{:^3d}个花露水'.format(9)  #(原字符串居中)
print(strvar)  #  9 个花露水
print('---------------------------------1  :d')

# 二 浮点型 :f
# 01  :f 浮点型占位符 (强制要求类型是浮点型) 默认保留小数6位
strvar = '薪资{:f}'.format(9.9)
print(strvar)  #薪资9.900000

# 02   :.2f 小数点后保留2位,存在四舍五入
strvar = '薪资{:.2f}'.format(9.188888)
print(strvar)  #薪资9.19
print('---------------------------------2  :f')

# 三  :s 字符串占位符
strvar = '{:s}'.format('杨元涛真帅')
# strvar = '{}'.format('杨元涛真帅')  #和上面行等效
print(strvar)  #杨元涛真帅
print('---------------------------------3 :s')

# 四  :, 金钱占位符  三位一分割  千 百万million  十亿billion
strvar = '{:,}'.format(1234348385)
print(strvar) #1,234,348,385
print('---------------------------------4 :,')

# 综合案例
strvar = '{:s}开工资{:.2f}元,买了{:d}个兰博基尼'.format('孙健',30000.12845,10)
print(strvar)
# 孙健开工资30000.13元,买了10个兰博基尼




















