#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@time:  2020/9/20 15:46

# 1.什么是原码 反码 补码?
# 2.进制转换
# 	234 --> 2 8 16
# 3.进制转换
# 	ob10101101
# 	0o137
# 	0xabc  --> 十进制
# 4.进制转换
# 	0xabc --> 八进制
# 5.计算 9 + (-3) 以及 -9 + 3
# 6.什么是注释
# 7.注释种类
# 8.如何用注释排错
# 9.如何定义变量?
# 10.变量命名
# 11.如何交换变量?
# 12.python 6大标准数据类型
# 13.浮点数和复数的两种表达方法
# 14.写出三个转义字符,含义
# 15.简述如何使用字符串的格式化占位符?
# 16.简述容器类型各个特征
# 17.以下各是什么类型?
# 	()  (1)  ('abc')  (False)
# 18.字典的键和集合的值有什么要求?
# 19.用几种方式获取列表中的最后一个元素
# 20.  3.6 版本中,变量的缓存机制有哪些?








































