# 打印菱形小星星
"""
     *
    ***
   *****
  *******
 *********
***********
***********
 *********
  *******
   *****
    ***
     *
"""

'''
组成元素:空格 星星  换行

当前行空格数
当前行号   当前行空格数 
1	`			5
2				4
3				3
4				2
5				1 

当前行号和当前行空格数的关系
当前行空格数  = 6(总行数)-当前行号


当前行星星数和当前行号的关系:
当前行星星数=当前行号i*2-1=i*2-1

当前行号   当前行星星数
	1			1
	2			3
	3			5
	4			7


规律:
当前行空格数  = 6(总行数)-当前行号
当前行星星数=当前行号i*2-1=i*2-1

思路:
1.先打印上面的三角(和乘法表-第二象限类似)
	1 打印空格
	2 打印星星
	3 换行
2.再打印下面的三角(1进行翻转)

步骤:
1.三角形行数先写死
2.三角形行数后写活
'''


#1.三角形行数先写死  6
for i in range(1,7):	#正三角
	# 空格
	#当前行空格数  = 6(总行数)-当前行号
	# for k in range(6-i,-1,-1):  #只要5-i是正数,步长就是-1,否则,取不到值
	for k in range(5-i,-1,-1):  #只要5-i是正数,步长就是-1,否则,取不到值
		print(' ',end='')  #一组一个空格	
	
	# 打印星星
	#当前行星星数=当前行号i*2-1=i*2-1
	for j in range(i*2-1):
		print('*',end='')
	
	# 换行
	print()
# for i in range(1,7):	#正三角
for i in range(6,-1,-1):	#倒三角
	# 空格
	#当前行空格数  = 6(总行数)-当前行号
	# for k in range(5-i,-1,-1):  
	for k in range(5-i,-1,-1):  
		print(' ',end='')  #一组一个空格	
	
	# 打印星星
	#当前行星星数=当前行号i*2-1=i*2-1
	for j in range(i*2-1):
		print('*',end='')
	
	# 换行
	print()
print('-----------------------------1')

#1.三角形行数不固定
rows = 3
for i in range(1,rows+1):	#正三角
	# 空格
	#当前行空格数  = 6(总行数)-当前行号
	# for k in range(6-i,-1,-1):  #只要5-i是正数,步长就是-1,否则,取不到值
	for k in range(rows-1-i,-1,-1):  #只要5-i是正数,步长就是-1,否则,取不到值
		print(' ',end='')  #一组一个空格	
	
	# 打印星星
	#当前行星星数=当前行号i*2-1=i*2-1
	for j in range(i*2-1):
		print('*',end='')
	
	# 换行
	print()
# for i in range(1,7):	#正三角
for i in range(rows,-1,-1):	#倒三角
	# 空格
	#当前行空格数  = 6(总行数)-当前行号
	# for k in range(5-i,-1,-1):  
	for k in range(rows-1-i,-1,-1):  
		print(' ',end='')  #一组一个空格	
	
	# 打印星星
	#当前行星星数=当前行号i*2-1=i*2-1
	for j in range(i*2-1):
		print('*',end='')
	
	# 换行
	print()
print('-----------------------------2')





































