# (5) format的填充符号的使用(^ > <)
'''
^ 原字符串居中显示
> 原字符串居右显示
< 原字符串居左显示

[who:*^10]
* : 填充的符号
^ : 原字符串居中显示
10: 原字符串长度 + 填充符号的长度 = 10
'''

strvar = '{who:*^10}去长春长生医药公司,{do:>>10},感觉{feel:!<10}'\
.format(who='李亚锋',do='扎疫苗',feel='血槽被掏空')
print(strvar)  #***李亚锋****去长春长生医药公司,>>>>>>>扎疫苗,感觉血槽被掏空!!!!!


# (6)进制转换等特殊符号的使用(:d :f :s :,)

# :d 整型占位符(强制要求类型是整数)
strvar = '刘一峰昨天晚上买了{:d}个花露水泡脚'.format(9)
print(strvar)  #刘一峰昨天晚上买了9个花露水泡脚

# :3d 占3位,不够三位拿空格来补位(原字符串居右)
strvar = '刘一峰昨天晚上买了{:3d}个花露水泡脚'.format(9)
print(strvar)  #刘一峰昨天晚上买了  9个花露水泡脚
strvar = '刘一峰昨天晚上买了{:<3d}个花露水泡脚'.format(9)
print(strvar) # 刘一峰昨天晚上买了9  个花露水泡脚
strvar = '刘一峰昨天晚上买了{:^3d}个花露水泡脚'.format(9)
print(strvar) # 刘一峰昨天晚上买了 9 个花露水泡脚
 
# :f 浮点型占位符 (强制要求类型是浮点型) 默认保留小数6位
strvar = '王雨涵毕业之后的薪资是{:f}'.format(9.9)
print(strvar)

# :.2f 小数点后保留2位,四舍五入
strvar = '王雨涵毕业之后的薪资是{:.2f}'.format(9.188888888)
print(strvar) #王雨涵毕业之后的薪资是9.19

# :s 字符串占位符
strvar = '{:s}'.format('杨源涛真帅')
print(strvar)  #杨源涛真帅

# :, 金钱占位符
strvar = '{:,}'.format(12345678)
print(strvar)  #12,345,678

# 综合案例
strvar = '{:s}开工资{:.2f}元,买了{:d}个兰博基尼'.\
format('孙坚',30000.12456,10)
print(strvar)  #孙坚开工资30000.12元,买了10个兰博基尼



















































