#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@time:  2020/9/16 21:31

''''''
'''
# (1)打印 一行十个小星星* help(print)
# (2)通过打印一个变量的形式,展现一行十个小星星
# (3)一行十个换色的星星 ★☆★☆★☆★☆★☆
# (4)用一个循环,打印十行十列小星星
# (5) 一个循环实现十行十列,间隔换色的小星星
# (6)一个循环实现十行十列,隔行换色的小星星
'''
# (1)打印 一行十个小星星* help(print)
i = 0  #1 初始化变量
while i < 10:  # 2条件判断
	# 4 写逻辑
	print('*',end='')  #去掉换行  #**********
	i += 1    #3 自增
print('--------------------1')

# (2)通过打印一个变量的形式,展现一行十个小星星
i = 0
strvar = ''
while i < 10:
	strvar += "*"
	i += 1
print(strvar) #**********
print('--------------------2')

# (3)一行十个换色的星星 ★☆★☆★☆★☆★☆
i = 0
while i < 10:
	if i % 2 == 0:
		print('★',end='')
	else:
		print('☆', end='')  #★☆★☆★☆★☆★☆
	i += 1
print('--------------------3')

# (4)用一个循环,打印十行十列小星星
i = 0
while i < 100:
	# 1 打印100个小星星
	print('★',end='')

	# 2 换行
	if i % 10 == 9:
		print()  #换行
	i += 1
print('--------------------4')

# (5) 一个循环实现十行十列,间隔换色的小星星
i = 0
while i < 100:
	# 1 打印100个间隔换色的小星星
	if i % 2 == 0:
		print('★',end='')
	else:
		print('☆',end='')

	# 2 换行
	if i % 10 == 9:
		print()
	i += 1
print('--------------------5')

# (6)一个循环实现十行十列,隔行换色的小星星
i = 0
while i < 100:
	# 1 打印100个隔行换色的小星星
	if i // 10 % 2 == 0:  #关键 地板除后取余
		print('★',end='')
	else:
		print('☆',end='')
	# 2 换行
	if i % 10 ==9:
		print()
	i += 1
print('--------------------6')
























