''''''
'''
1.二进制表现的三种形式
原码:用来显示 补码:用来存储计算 反码:用来转换原码反码
正数 : 原码 = 反码 = 补码
负数 : 原码和补码 互为取反 + 1

5.
9
原码: 000 ... 1001 
反码: 000 ... 1001 
补码: 000 ... 1001 

-3
原码 100 ... 011
反码 111 ... 100
补码 111 ... 101

000 ... 1001 
111 ... 1101
000 ... 0110  => 6


-9
原码:100 ... 1001 
反码:111 ... 0110
补码:111 ... 0111

3
原码 000 ... 011
反码 000 ... 011
补码 000 ... 011

111 ... 0111
000 ... 0011
111 ... 1010 补码

给你补码求原码
补码:111 ... 1010
反码:100 ... 0101
原码:100 ... 0110  -6

6注释就是对代码的解释,用来方便大家阅读代码的
7.注释种类:单行注释 多行注释
8.包裹代码划分范围,依次缩小范围找单行错误
9.a =1 ,b = 2,a,b = 3,4 a=b=100
10.字母数字下划线,首字符不能为数字,严格区分大小写,不能使用关键字,变量命名有意义,且不能使用中文哦
11. a,b = b,a  
tmp = a
a = b
b = tmp
12.int float complex bool str list tuple set dict
13.
f = 3.56  f = 3e4 f = 3e-4
c = 3+4j  c = complex(3,4)
14.\n \t \r
15."字符串" % (值1,值2 ... ) %d %f %s
16.list : 可获取可修改有序 tuple/str:可获取,不可修改,有序 set:无序,自动去重 dict:键值对存储的数据,表面上有序,本质上无序
17.空元祖 整型 字符串 元组
18.可哈希不可修改的类型 Number str tuple
19.lst[-1] lst[len(lst) - 1]
20.int:-5~正无穷  float: 非负数 bool:值相同 complex:只有虚数例外,剩下都不一样
   str:值相同即可 tuple:空元组即可 其他容器都不相同;

'''













