# ### 在同一文件中,变量的缓存机制 (仅仅针对python3.6版本负责)
# 1.对于整型而言，-5~正无穷范围内的相同值 id一致
var1 = -5
var2 = -5
print(id(var1),id(var2))  #11094112 11094112

var1 = -6
var2 = -6
print(id(var1),id(var2))  #140574484505392 140574484505552


# 2.对于浮点数而言，非负数(正浮点数 0.0)范围内的相同值 id一致
var1 = 0.0
var2 = 0.0
print(id(var1),id(var2))  #140553538523496 140553538523496

var1 = -1.0
var2 = -1.0
print(id(var1),id(var2))   #140326053409248 140326053409296


# 3.布尔值而言,值相同情况下，id一致
var1 = True
var2 = True
print(id(var1) , id(var2) )  #10414528 10414528
print('--------------------------- 3 bool')


# 4.复数在 实数+虚数 这样的结构中永不相同(只有正虚数的情况例外)
var1 = 4 +5j
var2 = 4 +5j
print(id(var1) , id(var2) )  #140427203326736 140427203327088

var1 = -5j
var2 = -5j
print(id(var1) , id(var2) ) #140630782739728 140630782739760

var1 = 5j
var2 = 5j
print(id(var1) , id(var2) )  #140465624606640 140465624606640
print('--------------------------- 4 complex')

# -->容器类型部分
# 5.字符串 和 空元组 相同的情况下，地址相同
var1 = "你"
var2 = "你"
print(id(var1) , id(var2) )  #140617076195616 140617076195616

var1 = ()
var2 = ()
print(id(var1) ,id(var2))  #139802465075272 139802465075272
print('--------------------------- 5 str ()')


# 6.列表，元组，字典，集合无论什么情况 id标识都不同 [空元组例外]
var1 = (1,2)
var2 = (1,2)
print(id(var1) ,id(var2))  #139984582898824 139984582898888

var1 = [1,2,3]
var2 = [1,2,3]
print(id(var1) ,id(var2)) #139810503126920 139810503126856

var1 = {1,2,3}
var2 = {1,2,3}
print(id(var1) ,id(var2))  #140282732613704 140282732127848

var1 = {1:2}
var2 = {1:2}
print(id(var1) ,id(var2))  #139907862091744 139907862091816
print('--------------------------- 6 tuple list dict set')






























