#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@time:  2020/9/19 19:32

# 打印菱形小星星
"""
     *
    ***
   *****
  *******
 *********
***********
***********
 *********
  *******
   *****
    ***
     *
"""

'''
组成:空格+星星+换行

1.当前行空格数= 总行数 - 当前行号
2.当前行星星数 = row(当前行号) * 2 -1


3. 当前行星星数 和 当前行号的关系
行号   星星数		空格数   总行数
1		1			5			6
2		3			4			6
3		5			3			6
4 		7			2			6
5		9			1			6
6		11			0			6
'''

# 先把总行号写死,再写活

#办法1  菱形固定12行
for i in range(1,7):  #控制行号  #正三角
	# 打印空格
	#1.当前行空格数= 总行数 - 当前行号i
	for k in range(6-i,0,-1):
		print(' ',end='')
	
	# 打印表达式
	for j in range(i*2-1):  #控制列
	# 2.当前行星星数 = 当前行号i * 2 -1
		print('*',end='')
	
	# 换行
	print()

# for i in range(6,-1,-1):  #控制行号   #正三角
for i in range(6,-1,-1):  #控制行号   #倒三角
	# 打印空格
	#1.当前行空格数= 总行数 - 当前行号
	for k in range(6-i,0,-1):
		print(' ',end='')
	
	# 打印表达式
	for j in range(i*2-1):  #控制列
	# 2.当前行星星数 = 当前行号i * 2 -1
		print('*',end='')
	
	# 换行
	print()
print('----------------------------------1')

#办法2  菱形行数不固定
rows = 3
for i in range(1,rows+1):  #控制行号  #正三角
	# 打印空格
	#1.当前行空格数= 总行数 - 当前行号i
	for k in range(rows-i,0,-1):
		print(' ',end='')
	
	# 打印表达式
	for j in range(i*2-1):  #控制列
	# 2.当前行星星数 = 当前行号i * 2 -1
		print('*',end='')
	
	# 换行
	print()

# for i in range(6,-1,-1):  #控制行号   #正三角
for i in range(rows,-1,-1):  #控制行号   #倒三角
	# 打印空格
	#1.当前行空格数= 总行数 - 当前行号
	for k in range(rows-i,0,-1):
		print(' ',end='')
	
	# 打印表达式
	for j in range(i*2-1):  #控制列
	# 2.当前行星星数 = 当前行号i * 2 -1
		print('*',end='')
	
	# 换行
	print()
print('----------------------------------2')














































