# ### (1)算数运算符:  + - * / // % **

# / 结果永远为小数
var1 = 10
var2 = 5
res = var1 / var2
print(res) #2.0

# // 地板除
# """被除数 ➗ 除数 = 商"""
# """注意点:如果被除数或者除数是小数,那么得到正常结果之后,数值后面带上.0变成小数"""
var1 = 10.0
var2 = 3.0
res = var1 // var2
print(res) #3.0

# %  取余
var1 = 7
var2 = 4
res = var1 % var2
print(res)  #3

res = -7 % -4 # 商是1 余数是-3  余数和除数的符号一致
print(res)  #-3

res = -7 % 4 # 商是-1 余数是-3 余数的符号需要和除数的符号一致 最后余数-3+4=1
print(res)  #1

res = 7 % -4 # 商是-2 余数是7-8=-1  余数和除数的符号一致
print(res) #-1

# ** 幂运算
res = 2 ** 3 
print(res) #8

# (2)比较运算符:  > < >= <= ==  !=  
# """比较运算符的结果要么是True , 要么是False 只有两个值"""
res = 10 > 5
res = 10 >= 10
# ==这个符号是在做比较,比较==两边的数值是否一样
res = 5 == 9
res = 5 != 9 
print(res)

# 常见错误
# == 是比较运算符  比较数值的大小
# =  是赋值运算符   给变量复制



























































































