# #!/usr/bin/env python
# #-*- coding:utf-8 -*-
# #@author: wangtongpei
# #@time:  2020/10/5 9:34
#
# # 1原码反码补码之间的关系
# #
# # 2用补码计算5 - 3
# #
# # 3用补码计算 - 5 + 3
# #
# # 4注释的种类
# #
# # 5注释注意什么
# #
# # 6如何用注释排错
# #
# # 7如何定义变量
# #
# # 8变量如何命名
# #
# # 9变量的交换方法
#
#
#
# # 1原码反码补码之间的关系
# # 正数  符号位 0 三码一致
# # 负数  符号位 1 三码不一致
# 	# 反码=原码的各位1变0 0变1 符号位不变
# 	# 补码=原码取反后,末位加1     用于存储和运算
# 	# 原码=补码取反后,末位加1	  用于展示
#
# # 2用补码计算5 - 3  5+(-3)
# 5  # 正数  符号位 0 三码一致
# 原码 0 000 0101
# 反码 0 000 0101
# 补码 0 000 0101
#
# -3 负数  符号位 1 三码不一致
# 原码  1 0000 0011
# 反码  1 1111 1100   符号位不变
# 补码  1 1111 1101
#
# 补码1  0 000  0101
# 补码2  1 1111 1101  符号位要运算
# 补码3  0 0000 0010  符号位是0 正数  三码一致
#
# 反码	0 0000 0010
# 原码	0 0000 0010  #2
#
# # 3用补码计算 - 5 + 3
# -5  负数  符号位 1 三码不一致
# 原码  1 0000 0101
# 反码  1 1111 1010  取反符号位不变
# 补码  1 1111 1011
#
# 3  正数  符号位 0 三码一致
# 原码 0 0000 0011
# 反码 0 0000 0011
# 补码 0 0000 0011
#
# 补码1  1 1111 1011
# 补码2  0 0000 0011
# 补码3  1 1111 1110  符号位是1 负数  三码不一致
#
# 反码   1 0000 0001  #取反符号位不变
# 原码   1 0000 0010  -2  符号位是1 负数
#
#
# # 4注释的种类
# 单行注释  #
# 多行注释  多行# 三引号
#
# # 5注释注意什么
# 单双引号要岔开
#
# # 6如何用注释排错
# 一行一行注释,逐步缩小排查范围
#
# # 7如何定义变量
# 概念:变化的量就是变量
# a = 1
#
# # 8变量如何命名
# 字母数字下划线,不能数字开头
# 严格区分大小写,不能使用关键字
# 变量命名有意义,不能使用中文
#
# # 9变量的交换方法
# a = 1
# b = 2
# # 方法1  通用  临时变量
# tmp = a
# a = b
# b = tmp
#
#
# # 方法2  特有
# a,b = b,a
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
