# 3.将文件中每一行的内容封装在自定义的对象属性中.并将所有对象插入到空列表中


lst = [
{"id":"1","name" :"alex","age":"28","hobbies":["上窜","瞎跳","真能浪"]},
{"id":"2", "name" : "wusir","age":"23","hobbies":["忽悠","吹牛"]},
{"id":"3","name" :"宋仲基","age":"99","hobbies":["撩妹","思密达","怕不怕"]}
]

print(lst)
# [{'id': '1', 'name': 'alex', 'age': '28', 'hobbies': ['上窜', '瞎跳', '真能浪']},
# {'id': '2', 'name': 'wusir', 'age': '23', 'hobbies': ['忽悠', '吹牛']},
# {'id': '3', 'name': '宋仲基', 'age': '99', 'hobbies': ['撩妹', '思密达', '怕不怕']}]










































