#!/usr/bin/env python
#-*- coding:utf-8 -*-
#@author: wangtongpei
#@time:  2020/9/27 8:35

''''''
'''

# 1# 什么是推导式,推导式完成1~100的列表
# 2#[1,2,3,4]=[2,8,24,64]
# 3#[1，2,3,4,5 ,6,67,7,81只要偶数
# 4#lst1 =["a","b","c"]和1st2 = ["1",2","3]按照索引把两个列表中的元素拼接在一起存新列表
# 5#(1).{ 'x': 'A'，'Y': 'B'，'z': 'C'}把字典写成x-A，y=B，z=c的列表推导式
# 6#(2).把列表中所有字符变成小写[ ""ADDD", "dddDD","DDaa", "sss"]
# 7#(3）.x是0-5之间的偶数，y是o-5之间的奇数把x,y组成一起变成元组,放到列表当中
# 8#(4）.使用列表推导式制作所有99乘法表中的运算
# 9#(5)#求M，H中矩阵和元素的乘积
# 10#M= [ [1,2,31，
# #
# [4,5 ,61，
# #
# [7,8,9] ]
# H= [[2,2,21，
# #
# [3,3,3]，
# #
# [4,4,4]l
# #=→实现效果1[2，4,6，12，15，18，28，32，36]
# #=→实现效果2[[2，4，6]，[12，15，18]，[28，32，36]]
# 11#""I"
# 案例:
# 满足年龄在18到21，存款大于等于5000小于等于5500的人，
# 开卡格式为:尊贵VIP卡老x(姓氏)，否则开卡格式为:抠脚大汉卡老x(姓氏)
# 把并卡的种类统计出来
# r.?
# 12#enumerate和zip如何使用
# 13#定义生成器的两种方式
# 14#next和send有什么不同
# 15#生成器写斐波那契数列
'''



















